In [1]:
import pandas as pd

In [2]:
city_pop_raw = pd.read_csv('city-population/unsd-citypopulation-year-both.csv')
city_pop = pd.DataFrame()
city_pop['date'] = city_pop_raw['Year'] + '-01-01'
city_pop['name'] = city_pop_raw['City']
city_pop['group'] = city_pop_raw['Country or Area']
city_pop['value'] = city_pop_raw['Value']
city_pop.to_csv('_processed/city-population.csv', index=False)
city_pop.head()

         date       name          group    value
0  2013-01-01  MARIEHAMN  Åland Islands    11370
1  2012-01-01  MARIEHAMN  Åland Islands  11304.5
2  2011-01-01  MARIEHAMN  Åland Islands  11226.5
3  2010-01-01  MARIEHAMN  Åland Islands  11156.5
4  2009-01-01  MARIEHAMN  Åland Islands    11064

In [3]:
covid_19_raw = pd.read_csv('covid-19/time-series-19-covid-combined.csv')
covid_19 = pd.DataFrame()
covid_19['date'] = covid_19_raw['Date']
covid_19['name'] = covid_19_raw['Country/Region']
covid_19['value'] = covid_19_raw['Confirmed']
covid_19.to_csv('_processed/covid-19.csv', index=False)
covid_19.head()

         date         name  value
0  2020-01-22  Afghanistan    0.0
1  2020-01-23  Afghanistan    0.0
2  2020-01-24  Afghanistan    0.0
3  2020-01-25  Afghanistan    0.0
4  2020-01-26  Afghanistan    0.0

In [4]:
exchange_raw = pd.read_csv('exchange-rates/monthly.csv')
exchange = pd.DataFrame()
exchange['date'] = exchange_raw['Date']
exchange['name'] = exchange_raw['Country']
exchange['value'] = exchange_raw['Exchange rate'].round(2)
exchange.to_csv('_processed/exchange-rates.csv', index=False)
exchange.head()

         date       name  value
0  1971-01-01  Australia   0.89
1  1971-02-01  Australia   0.89
2  1971-03-01  Australia   0.89
3  1971-04-01  Australia   0.89
4  1971-05-01  Australia   0.89

In [5]:
city_pop2.head()

NameError: name 'city_pop2' is not defined